# -*- coding: utf-8 -*-
"""
Spyder Editor
班級:資管4A
學號:104111118
姓名:黃凱裕
日期:2019/7/3
題目:請撰寫一程式，讓使用者輸入四個數字x1、y1、x2、y2，分別代表兩個點的座標(x1, y1)、(x2, y2)。
計算並輸出這兩點的座標與其歐式距離。
提示1：歐式距離 =√((x1−x2)2+(y1−y2)2)=((x1−x2)2+(y1−y2)2)
提示2：兩座標的歐式距離，輸出到小數點後第4位
版本:1.0
說明:
"""
x1 = eval(input("輸入x1:"))
y1 = eval(input("輸入y1:"))
x2 = eval(input("輸入x2:"))
y2 = eval(input("輸入y2:"))
print('( {} , {} )'.format(x1,y1))
print('( {} , {} )'.format(x2,y2))
print("歐式距離 = {:.4f}".format(((x1-x2)**2+(y1-y2)**2)**0.5))